/*data.js*/

// 歌词
var lyricObj = { 
	 "nizhan" : "[00:00.00] 张杰 - 逆战[00:15.99] 在这个风起云涌的战场上[00:20.24] 暴风少年登场[00:24.00] 在战胜烈火重重的咆哮声[00:28.10] 喧闹整个世界[00:31.82] 硝烟狂飞的讯号 机甲时代正来到[00:36.03] 热血逆流而上[00:39.89] 战车在发烫 勇士也势不可挡[00:51.06] 闯荡宇宙摆平世界[00:54.78] Oh 逆战 逆战狂野 王牌要发泄[00:59.12] 战斗是我们倔强起点[01:03.01] 我要操控我的权势 张扬我的声势[01:07.61] 看这场龙战在野[01:10.54] 这战场千百热血战士 一路向前飞驰[01:15.59] 捍卫世界的勇士 Fighting 再一决[01:23.23][01:28.26] 在这个风起云涌的战场上[01:32.19] 暴风少年登场[01:35.81] 在战胜烈火重重的咆哮声[01:40.05] 喧闹整个世界[01:44.01] 硝烟狂飞的讯号 机甲时代正来到[01:48.11] 热血逆流而上[01:52.08] 战车在发烫 勇士也势不可挡[02:03.04] 闯荡宇宙摆平世界[02:06.76] Oh 逆战 逆战狂野 王牌要发泄[02:10.95] 战斗是我们倔强起点[02:15.06] 我要操控我的权势 张扬我的声势[02:19.69] 看这场龙战在野[02:22.59] 这战场千百热血战士 一路向前飞驰[02:27.70] 捍卫世界的勇士 Fighting 再一决[02:35.36][02:39.87] 兄弟一场 未来继续顽强[02:43.68] 看着战火飘摇[02:47.88] 瓦解对手力量 熊熊气势再出发[02:54.89] 逆战 逆战来也 王牌要狂野[02:59.02] 闯荡宇宙摆平世界[03:02.76] Oh 逆战 逆战狂野 王牌要发泄[03:07.06] 战斗是我们倔强起点[03:11.28] 我要操控我的权势 张扬我的声势[03:15.65] 看这场龙战在野[03:18.65] 这战场千百热血战士 一路向前飞驰[03:23.69] 捍卫世界的勇士 Fighting 再一决[03:32.64]", 
	"fannaoge" : "[00:00.00] 张学友 - 烦恼歌[00:02.82] 专辑：在你身边[00:07.65] 前奏[00:30.19] 不爱的不断打扰[00:32.49] 你爱的不在怀抱[00:35.79] 得到手的不需要[00:38.28] 渴望拥有的得不到[00:40.88] 苦恼 倒不如说声笑笑[00:45.94] 生活不要 太多钞票[00:48.47] 多了就会带来困扰[00:51.62] 过重的背包[00:54.72] 过度的暴躁[00:56.17] 什么都不要[01:00.85] 一起呼叫[01:02.97] 没有烦恼[01:03.98] 除了呼吸其他不重要[01:06.71] 除了现在什么都忘掉[01:09.23] 心事像羽毛 越飘越逍遥[01:11.87] 烦恼什么烦恼[01:14.09] 除了心跳没有大不了[01:16.87] 人们不该去羡慕飞鸟[01:19.26] 世界比我大 把自我缩小[01:26.90] 把自己的当做跳蚤[01:29.51] 谁也不值得骄傲[01:32.72] 人间疾苦知多少[01:35.26] 花开到花落知多少[01:37.90] 大不了 把一切看成玩笑[01:42.85] 吵吵闹闹像G大调[01:45.46] 假装什么都不知道[01:48.08] 过重的背包[01:50.12] 过度的暴躁[01:52.52] 什么都不要[01:57.01] 间奏[02:19.85] 不和谁比较[02:22.55] 不和谁争吵[02:25.09] 过份思考 庸人自扰[02:27.74] 别庸人自扰[02:30.08] 一切轻于鸿毛[02:32.50] 才能消灭烦恼[02:36.82] 一起呼叫[02:38.86] 没有烦恼[02:40.17] 除了呼吸其他不重要[02:42.66] 除了现在什么都忘掉[02:45.21] 心事像羽毛 越飘越逍遥[02:48.08] 烦恼什么烦恼[02:50.30] 除了心跳没有大不了[02:52.92] 人们不该去羡慕飞鸟[02:55.45] 世界比我大 把自我缩小[02:58.00] 烦恼什么烦恼[03:00.23] 除了心跳没有大不了[03:02.82] 人们不该去羡慕飞鸟[03:05.34] 世界比我大 把自我缩小", 
	 "hongchenkezhan" : "[00:00.00] 周杰伦 - 红尘客栈（正式版）[00:04.95] 作词：方文山[00:06.95] 作曲：周杰伦[00:22.40] 天涯 的尽头是风沙[00:27.63] 红尘 的故事叫牵挂[00:32.75] 封刀隐没在寻常人家 东篱下[00:38.34] 闲云 野鹤 古剎[00:44.01] 快马 在江湖里厮杀[00:48.94] 无非 是名跟利放不下[00:54.01] 心中有江山的人岂能快意潇洒[00:59.62] 我只求与你共 华发[01:08.16] 剑出鞘 恩怨了 谁笑[01:12.57] 我只求今朝 拥你入 怀抱[01:17.95] 红尘客栈风似刀 骤雨落 宿命敲[01:27.31] 任武林谁领风骚我却 只为你 折腰[01:33.75] 过荒村野桥 寻世外 古道[01:39.32] 远离人间尘嚣 柳絮飘执子之手逍遥[02:07.08] 檐下 窗棂斜映枝桠[02:12.05] 与你 席地对座饮茶[02:17.63] 我以工笔画将你牢牢 的记下[02:23.22] 提笔 不为风雅[02:28.04] 灯下 叹红颜近晚霞[02:33.33] 我说缘份 一如参禅不说话[02:38.93] 你泪如梨花洒满了纸上的天下[02:44.59] 爱恨如写意 山水画[02:51.64] 剑出鞘 恩怨了 谁笑[02:56.59] 我只求今朝 拥你入 怀抱[03:01.88] 红尘客栈风似刀 骤雨落 宿命敲[03:11.32] 任武林谁领风骚我却 只为你 折腰[03:17.86] 过荒村野桥 寻世外 古道[03:23.51] 远离人间尘嚣 柳絮飘执子之手逍遥[03:49.24] 任武林谁领风骚我却 只为你 折腰[03:55.25] 你回眸多娇 我泪中 带笑[04:00.69] 酒招旗风中萧萧 剑出鞘 恩怨了", 
	 "yixiangren" : "[00:00.00] 李健 - 异乡人[00:12.26] 披星戴月地奔波[00:15.15] 只为一扇窗[00:18.25] 当你迷失在路上[00:21.58] 能够看见那灯光[00:24.86] 不知不觉把他乡[00:28.19] 当做了故乡[00:31.32] 只是偶尔难过时[00:34.76] 不经意遥望远方[00:37.36] 曾经的乡音[00:40.55] 悄悄地隐藏[00:43.81] 说不出的诺言[00:46.52] 一直放心上[00:50.67] 有许多时候[00:53.94] 眼泪就要流[00:57.93] 那扇窗是让我[01:00.85] 坚强的理由[01:05.03] 小小的门口[[01:07.93] 还有她的温柔[01:11.35] 给我温暖陪伴我左右[01:33.63][01:46.26] 披星戴月地奔波[01:51.26] 只为一扇窗[01:54.54] 当你迷失在路上[01:57.74] 能够看见那灯光[02:00.89] 不知不觉把他乡[02:04.25] 当做了故乡[02:07.43]只是偶尔难过时[02:10.84] 不经意遥望远方[02:13.63] 曾经的乡音[02:16.88] 悄悄地隐藏[02:20.29]说不出的诺言[02:22.77]一直放心上[02:27.28]有许多时候[02:30.48] 眼泪就要流[02:34.28] 那扇窗是让我[02:36.83] 坚强的理由[02:40.67] 小小的门口[02:44.05] 还有她的温柔[02:47.48] 给我温暖陪伴我左右[02:55.64]有许多时候[02:58.61] 眼泪就要流[03:01.99] 那扇窗是让我[03:04.73] 坚强的理由[03:08.48]小小的门口[03:11.60] 还有她的温柔[03:14.95] 给我温暖陪伴我左右[03:20.84] 给我温暖陪伴我左右", 
	 "xiangyiweiming" : "[00:00.00] 陈小春 - 相依为命 [00:04.18] 永远爱着荷荷的Sn.[00:20.88] 旁人在 淡出终于只有你共我一起[00:28.13] 仍然自问幸福虽说有阵时为你生气[00:35.24] 其实以前和你互相不懂得死心塌地[00:42.64] 直到共你渡过多灾世纪[00:49.18] 即使身边世事再毫无道理 与你永远亦连在一起[00:56.49] 你不放下我 我不放下你[00:59.98] 我想确定每日挽着同样的手臂[01:04.98] 不敢早死要来陪住你 我已试够别离并不很凄美[01:14.81] 我还如何撇下你[01:23.28] 永远爱着荷荷的Sn.[01:35.21] 年华像细水冲走几个爱人与知己[01:42.07] 抬头命运射灯光柱罩下来是我跟你[01:49.23] 难道有人离去是想显出好光阴 有限[01:56.37] 让我学会为你 贪生怕死[02:02.81] 即使身边世事再毫无道理 与你永远亦连在一起[02:10.06] 你不放下我 我不放下你[02:13.63] 我想确定每日挽着同样的手臂[02:18.56] 不敢早死要来陪住你 我已试够别离并不很凄美[02:28.39] 见尽了 云涌风起 还怎么舍得放下你[02:41.58] 证明爱人又爱己 何以要那么悲壮才合理[02:50.98] 即使身边世事再毫无道理 与你永远亦连在一起[02:58.04] 你不放下我 我不放下你[03:01.58] 我想确定每日挽着同样一双臂[03:06.56] 不必挑选我们成大器[03:09.97] 当我两个并无冒险的福气[03:16.41] 见尽了 云涌风起 还怎么舍得放下你[03:25.51] 我们仍珍惜这啖气[03:35.21] 永远爱着荷荷的Sn.", 
	 "bujiangjiu" : "[00:00.00] 不将就 - 李荣浩[00:06.34] 词：黄伟文、李荣浩[00:08.14] 曲：李荣浩[00:13.41] 那时候 我以为爱的是生活[00:19.79] 也算懂得 什么适合什么不可[00:26.60] 最近还是一样努力着[00:30.14] 配合你的性格[00:33.10] 你的追求者 你的坎坷[00:36.63] 我开的车[00:40.24] 算一算 虚度了多少个年头[00:46.56] 彷佛足够写一套错爱的春秋[00:53.25] 如果以后 你还想为谁[00:56.74] 浪费美好时候[00:59.87] 眼泪只能在我的胸膛[01:03.27] 毫无保留[01:10.23] 互相折磨到白头[01:16.84] 悲伤坚决不放手[01:23.66] 开始纠缠之后[01:28.64] 才又被人放大了自由[01:37.04] 你的暴烈太温柔[01:43.55] 感情又痛又享受[01:50.24] 如果我说不吻你不罢休[01:56.09] 谁能逼我将就[02:06.99] 你问我 为什么顽固而专一[02:13.23] 天下太大 总有人比你更合适[02:19.89] 其实我觉得这样不值[02:23.50] 可没选择方式[02:26.54] 你一出场别人都显得不过如此[02:35.29] 互相折磨到白头[02:41.82] 悲伤坚决不放手[02:48.55] 开始纠缠之后[02:53.57] 才又被人放大了自由[03:01.96] 你的暴烈太温柔[03:08.51] 感情又痛又享受[03:15.22] 如果我说不吻你不罢休[03:21.06] 谁能逼我将就[03:58.56] 互相折磨到白头[04:05.38] 悲伤坚决不放手[04:11.71] 开始纠缠之后[04:16.83] 才又被人放大了自由[04:25.26] 你的暴烈太温柔[04:31.75] 感情又痛又享受[04:38.61] 如果我说不吻你不罢休[04:44.42] 谁能逼我将就[04:51.13] 他们不过将就", 
	 "qudali" : " [00:00.00] 去大理 - 郝云[00:06.45] 词曲：郝云[00:09.68] 编曲：郝云[00:16.95] 是不是对生活不太满意[00:24.03] 很久没有笑过又不知为何[00:32.53] 既然不快乐又不喜欢这里[00:39.43] 不如一路向西去大理[00:47.69] 路程有点波折空气有点稀薄[00:55.70] 景色越辽阔 心里越寂寞[01:03.73] 不知道谁在何处等待[01:11.23] 不知道后来的后来[01:18.01] 谁的头顶上没有灰尘[01:26.16] 谁的肩上没有过齿痕[01:33.68] 也许爱情就在洱海边等着[01:42.15] 也许故事正在发生着[02:20.91] 谁的头顶上没有灰尘[02:28.53] 谁的肩上没有过齿痕[02:36.17] 也许爱情就在洱海边等着[02:43.75] 也许故事正在发生着[02:51.88] 谁的头顶上没有灰尘[02:59.21] 谁的肩上没有过齿痕[03:06.85] 捡起被时间碾碎的勇气[03:15.15] 让双脚沾满清香的泥", 
	 "dongxiaojie" : "[00:00.00] 宋冬野 - 董小姐[00:04.81] 词曲：宋冬野[00:37.20] 董小姐你从没忘记你的微笑[00:43.04] 就算你和我一样 渴望着衰老[00:52.29] 董小姐你嘴角向下的时候很美[00:58.33] 就像安和桥下 清澈的水[01:07.63] 董小姐我也是个复杂的动物[01:13.67] 嘴上一句带过心里却一直重复[01:22.97] 董小姐鼓楼的夜晚时间匆匆[01:28.87] 陌生的人请给我一支兰州[01:37.52] 所以那些可能都不是真的董小姐[01:44.53] 你才不是一个没有故事的女同学[01:52.16] 爱上一匹野马可我的家里没有草原[01:59.12] 这让我感到绝望 董小姐[02:40.54] 董小姐你熄灭了烟说起从前[02:46.99] 你说前半生就这样吧 还有明天[02:56.61] 董小姐你可知道我说够了再见[03:03.36] 在五月的早晨终于丢失了睡眠[03:12.21] 所以那些可能都不是真的董小姐[03:19.69] 你才不是一个没有故事的女同学[03:27.87] 爱上一匹野马可我的家里没有草原[03:35.29] 这让我感到绝望 董小姐[03:44.49] 所以那些可能都会是真的董小姐[03:51.60] 谁会不厌其烦的安慰那无知的少年[04:00.76] 我想和你一样 不顾那些所以[04:07.88] 跟我走吧 董小姐[04:16.07] 躁起来吧 董小姐", 
	"cengjingdeni" : "[00:00.00] 曾经的你 - 许巍  [00:10.73] 曾梦想仗剑走天涯[00:15.47] 看一看世界的繁华[00:20.59] 年少的心总有些轻狂[00:25.97] 如今你四海为家[00:30.77] 曾让你心疼的姑娘[00:35.74] 如今已悄然无踪影[00:40.90] 爱情总让你渴望又感到烦恼[00:45.89] 曾让你遍体鳞伤[00:51.31] dilililidilililidada[00:55.75] dilililidilililidada[01:00.74] dilililidilililidada[01:05.09] 走在勇往直前的路上[01:11.04] dilililidilililidada[01:16.19] dilililidilililidada[01:21.10] dilililidilililidada[01:24.93] 有难过也有精彩[01:51.28] 每一刻难过的时候[01:56.33] 就独自看一看大海[02:01.41] 总想起身边走在路上的朋友[02:06.37] 有多少正在疗伤[02:11.51] dilililidilililidada[02:16.29] dilililidilililidada[02:21.32] dilililidilililidada[02:25.60] 不知多少孤独的夜晚[02:31.56] dilililidilililidada[02:36.57] dilililidilililidada[02:41.89] dilililidilililidada[02:45.60] 从昨夜酒醉醒来[02:51.99] 每一刻难过的时候[02:56.55] 就独自看一看大海[03:01.59] 总想起身边走在路上的朋友[03:06.73] 有多少正在醒来[03:11.87] 让我们干了这杯酒[03:16.84] 好男儿胸怀象大海[03:21.80] 经历了人生百态世间的冷暖[03:26.70] 这笑容温暖纯真[03:31.95] 每一刻难过的时候[03:36.97] 就独自看一看大海[03:42.01] 总想起身边走在路上的朋友[03:46.73] 有多少正在醒来[03:52.02] 让我们干了这杯酒[03:57.01] 好男儿胸怀象大海[04:02.08] 经历了人生百态世间的冷暖", 
	"naxiehua" : "[00:00.00] 那些花儿 - 朴树  [00:16] 那片笑声让我想起我的那些花儿[00:24] 在我生命每个角落静静为我开着[00:32] 我曾以为我会永远守在她身旁[00:39] 今天我们已经离去在人海茫茫[00:45]中文歌词库 www.CnLyric.com[00:46] 她们都老了吧 她们在哪里呀[00:55] 幸运的是我 曾陪她们开放[01:01][01:02] 啦啦啦啦啦啦啦啦啦啦啦，想她[01:10] 啦啦啦啦啦啦啦啦[01:14] 她还在开吗[01:18] 啦啦啦啦啦啦啦啦啦啦啦，去呀[01:26] 她们已经被风吹走 散落在天涯[01:33][01:49] 有些故事还没讲完那就算了吧[01:57] 那些心情在岁月中已经难辨真假[02:05] 如今这里荒草丛生没有了鲜花[02:13] 好在曾经拥有你们的春秋和冬夏[02:20] 她们都老了吧 她们在哪里呀[02:28] 幸运的是我 曾陪她们开放[02:35][02:36]啦啦啦啦啦啦啦啦啦啦啦，想她[02:43] 啦啦啦啦啦啦啦啦[02:47] 她还在开吗[02:51] 啦啦啦啦啦啦啦啦啦啦啦，去呀[02:59] 她们已经被风吹走 散落在天涯[03:06] 啦啦啦啦啦啦啦啦啦啦啦，yiya[03:14] 啦啦啦啦啦啦啦啦[03:18] %&$@*[03:22] 啦啦啦啦啦啦啦啦啦啦啦，yiya[03:30] !@#$%^&*()_+|[03:36] $%&*@[03:45] !@#$%^&*()_+|[03:49] *#$%[03:53] #%&(!%@+$&^#@^[04:01] 你们就像被风吹走 插在了天涯[04:08] 她们都老了吧 她们还在开吗[04:16] 我们就这样 各自奔天涯[04:25]"
};

// 音乐列表数据
var dataObj = [
	{ "id" : 1, "name":"张杰" ,   "musicName" :"逆战" ,     "img" : "nizhan.jpg",         "audio" : "nizhan.m4a" ,         "lyric" : lyricObj.nizhan},
	{ "id" : 2, "name":"张学友" , "musicName" :"烦恼歌"   , "img" : "fannaoge.jpg",       "audio" : "fannaoge.m4a",        "lyric" : lyricObj.fannaoge},
	{ "id" : 3, "name":"周杰伦" , "musicName" :"红尘客栈" , "img" : "hongchenkezhan.jpg", "audio" : "hongchenkezhan.m4a",  "lyric" : lyricObj.hongchenkezhan},
	{ "id" : 4, "name":"李建" ,   "musicName" :"异乡人"   , "img" : "yixiangren.jpg",     "audio" : "yixiangren.m4a",      "lyric" : lyricObj.yixiangren},
	{ "id" : 5, "name":"陈小春" , "musicName" :"相依为命" , "img" : "xiangyiweiming.jpg", "audio" : "xiangyiweiming.m4a",  "lyric" : lyricObj.xiangyiweiming},
	{ "id" : 6, "name":"李荣浩" , "musicName" :"不将就" ,   "img" : "bujiangjiu.jpg",     "audio" : "bujiangjiu.m4a" ,     "lyric" : lyricObj.bujiangjiu},
	{ "id" : 7, "name":"郝云" ,   "musicName" :"去大理" ,   "img" : "qudali.jpg",         "audio" : "qudali.m4a" ,         "lyric" : lyricObj.qudali},
	{ "id" : 8, "name":"宋冬野" , "musicName" :"董小姐" ,   "img" : "dongxiaojie.jpg",    "audio" : "dongxiaojie.m4a" ,    "lyric" : lyricObj.dongxiaojie},
	{ "id" : 9, "name":"许巍" ,   "musicName" :"曾经的你" , "img" : "cengjingdeni.jpg",   "audio" : "cengjingdeni.m4a" ,   "lyric" : lyricObj.cengjingdeni},
	{ "id" : 10,"name":"朴树" ,   "musicName" :"那些花儿" , "img" : "naxiehua.jpg",       "audio" : "naxiehua.m4a" ,       "lyric" : lyricObj.naxiehua}
];

//留言内容
var messageObj = [
	{ "id" : 1,  "mid" : 1,  "text" : "逆战 留言1" },
	{ "id" : 2,  "mid" : 1,  "text" : "逆战 留言2" },
	{ "id" : 3,  "mid" : 1,  "text" : "逆战 留言3" },
	{ "id" : 4,  "mid" : 2,  "text" : "烦恼歌 留言1" },
	{ "id" : 5,  "mid" : 2,  "text" : "烦恼歌 留言2" },
	{ "id" : 6,  "mid" : 2,  "text" : "烦恼歌 留言3" },
	{ "id" : 7,  "mid" : 3,  "text" : "红尘客栈 留言1" },
	{ "id" : 8,  "mid" : 3,  "text" : "红尘客栈 留言2" },
	{ "id" : 9,  "mid" : 3,  "text" : "红尘客栈 留言3" },
	{ "id" : 10, "mid" : 4,  "text" : "异乡人 留言1" },
	{ "id" : 11, "mid" : 4,  "text" : "异乡人 留言2" },
	{ "id" : 12, "mid" : 4,  "text" : "异乡人 留言3" },
	{ "id" : 13, "mid" : 5,  "text" : "相依为命 留言1" },
	{ "id" : 14, "mid" : 5,  "text" : "相依为命 留言2" },
	{ "id" : 15, "mid" : 5,  "text" : "相依为命 留言3" },
	{ "id" : 13, "mid" : 6,  "text" : "不将就 留言1" },
	{ "id" : 14, "mid" : 6,  "text" : "不将就 留言2" },
	{ "id" : 15, "mid" : 6,  "text" : "不将就 留言3" },
	{ "id" : 16, "mid" : 7,  "text" : "去大理 留言1" },
	{ "id" : 17, "mid" : 7,  "text" : "去大理 留言2" },
	{ "id" : 18, "mid" : 7,  "text" : "去大理 留言3" },
	{ "id" : 19, "mid" : 8,  "text" : "董小姐 留言1" },
	{ "id" : 20, "mid" : 8,  "text" : "董小姐 留言2" },
	{ "id" : 21, "mid" : 8,  "text" : "董小姐 留言3" },
	{ "id" : 22, "mid" : 9,  "text" : "曾经的你 留言1" },
	{ "id" : 23, "mid" : 9,  "text" : "曾经的你 留言2" },
	{ "id" : 24, "mid" : 9,  "text" : "曾经的你 留言3" },
	{ "id" : 25, "mid" : 10, "text" : "那些花儿 留言1" },
	{ "id" : 26, "mid" : 10, "text" : "那些花儿 留言2" },
	{ "id" : 27, "mid" : 10, "text" : "那些花儿 留言3" }
];